---
title: StructuralSectionSigmaProfileWithLips
classe: Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionSigmaProfileWithLips
namespace: Autodesk.Revit.DB.Structure.StructuralSections
eredita: Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionColdFormed
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 4
---

# StructuralSectionSigmaProfileWithLips

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Double BendWidth { get; set; }` | `structuralSectionSigmaProfileWithLips.BendWidth` | Double |
| `Double LipLength { get; set; }` | `structuralSectionSigmaProfileWithLips.LipLength` | Double |
| `Double MiddleBendLength { get; set; }` | `structuralSectionSigmaProfileWithLips.MiddleBendLength` | Double |
| `Double TopBendLength { get; set; }` | `structuralSectionSigmaProfileWithLips.TopBendLength` | Double |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```